Revit 2024 API
StructuralFramingUtils.IsJoinAllowedAtEnd Method
 Identifies if the indicated end of the framing element is allowed to join to others.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool IsJoinAllowedAtEnd(
	FamilyInstance familyInstance,
	int end
)
Visual Basic
Public Shared Function IsJoinAllowedAtEnd ( _
	familyInstance As FamilyInstance, _
	end As Integer _
) As Boolean
Visual C++
public:
static bool IsJoinAllowedAtEnd(
	FamilyInstance^ familyInstance,
	int end
)
Parameters
familyInstance
Type: Autodesk.Revit.DB.FamilyInstance
 The FamilyInstance, which must be of a structural framing category.
end
Type: System.Int32
 The index of the end (0 for the start, 1 for the end).
Return Value
 True if it is allowed to join. False if it is disallowed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  end must be 0 or 1.
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category.
See Also
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace